{
  "id": "13Cej8yIsAddqZWelI0TzG",
  "description": "",
  "chapter_number": 24,
  "duration_ms": 1236924,
  "explicit": false,
  "images": [
    {
      "height": 640,
      "url": "https://i.scdn.co/image/ab676663000022a8071e33370b54de559d4b9f2f",
      "width": 640
    },
    {
      "height": 300,
      "url": "https://i.scdn.co/image/ab6766630000db5b071e33370b54de559d4b9f2f",
      "width": 300
    },
    {
      "height": 64,
      "url": "https://i.scdn.co/image/ab6766630000703b071e33370b54de559d4b9f2f",
      "width": 64
    }
  ],
  "languages": [
    ""
  ],
  "name": "Chapter 23",
  "audio_preview_url": null,
  "release_date": "0000",
  "release_date_precision": "year",
  "resume_point": {
    "fully_played": false,
    "resume_position_ms": 0
  },
  "html_description": "",
  "available_markets": [
    "CA",
    "US"
  ],
  "type": "chapter",
  "uri": "spotify:episode:13Cej8yIsAddqZWelI0TzG",
  "external_urls": {
    "spotify": "https://open.spotify.com/episode/13Cej8yIsAddqZWelI0TzG"
  },
  "href": "https://api.spotify.com/v1/chapters/13Cej8yIsAddqZWelI0TzG",
  "audiobook": {
    "authors": [
      {
        "name": "Amanda Lindhout"
      },
      {
        "name": "Sara Corbett"
      }
    ],
    "available_markets": [
      "CA",
      "PR",
      "US"
    ],
    "copyrights": [],
    "description": "Author(s): Amanda Lindhout, Sara Corbett\nNarrator(s): Amanda Lindhout\n\n<B>Amanda Lindhout reads her spectacularly dramatic memoir of a woman whose curiosity about the world led her from rural Canada to imperiled and dangerous countries on every continent, and then into fifteen months of harrowing captivity in Somalia-a story of courage, resilience, and extraordinary grace.</B><br><br>At the age of eighteen, Amanda Lindhout moved from her hardscrabble Alberta hometown to the big city-Calgary-and worked as a cocktail waitress, saving her tips so she could travel the globe. As a child, she escaped a violent household by paging through <I>National Geographic</I> and imagining herself in its exotic locales<I>.</I> Now she would see those places for real. She backpacked through Latin America, Laos, Bangladesh, and India, and emboldened by each experience, went on to travel solo across Sudan, Syria, and Pakistan. In war-ridden Afghanistan and Iraq she carved out a fledgling career as a TV reporter. And then, in August 2008, she traveled to Mogadishu, Somalia-\"the most dangerous place on earth\"-to report on the fighting there. On her fourth day in the country, she and her photojournalist companion were abducted.<br> <br>An astoundingly intimate and harrowing account of Lindhout's fifteen months as a captive, <I>A House in the Sky </I>illuminates the psychology, motivations, and desperate extremism of her young guards and the men in charge of them. She is kept in chains, nearly starved, and subjected to unthinkable abuse. She survives by imagining herself in a \"house in the sky,\" looking down at the woman shackled below, and finding strength and hope in the power of her own mind. Lindhout's decision, upon her release, to counter the violence she endured by founding an organization to help the Somali people rebuild their country through education is a wrenching testament to the capacity of the human spirit and an astonishing portrait of the power of compassion and forgiveness.",
    "edition": "Unabridged",
    "explicit": false,
    "external_urls": {
      "spotify": "https://open.spotify.com/show/46kJAa2zkV6OTiB2zHzg6X"
    },
    "href": "https://api.spotify.com/v1/audiobooks/46kJAa2zkV6OTiB2zHzg6X",
    "html_description": "Author(s): Amanda Lindhout, Sara Corbett<br/>Narrator(s): Amanda Lindhout<br/>&lt;B&gt;Amanda Lindhout reads her spectacularly dramatic memoir of a woman whose curiosity about the world led her from rural Canada to imperiled and dangerous countries on every continent, and then into fifteen months of harrowing captivity in Somalia-a story of courage, resilience, and extraordinary grace.&lt;/B&gt;&lt;br&gt;&lt;br&gt;At the age of eighteen, Amanda Lindhout moved from her hardscrabble Alberta hometown to the big city-Calgary-and worked as a cocktail waitress, saving her tips so she could travel the globe. As a child, she escaped a violent household by paging through &lt;I&gt;National Geographic&lt;/I&gt; and imagining herself in its exotic locales&lt;I&gt;.&lt;/I&gt; Now she would see those places for real. She backpacked through Latin America, Laos, Bangladesh, and India, and emboldened by each experience, went on to travel solo across Sudan, Syria, and Pakistan. In war-ridden Afghanistan and Iraq she carved out a fledgling career as a TV reporter. And then, in August 2008, she traveled to Mogadishu, Somalia-&#34;the most dangerous place on earth&#34;-to report on the fighting there. On her fourth day in the country, she and her photojournalist companion were abducted.&lt;br&gt; &lt;br&gt;An astoundingly intimate and harrowing account of Lindhout&#39;s fifteen months as a captive, &lt;I&gt;A House in the Sky &lt;/I&gt;illuminates the psychology, motivations, and desperate extremism of her young guards and the men in charge of them. She is kept in chains, nearly starved, and subjected to unthinkable abuse. She survives by imagining herself in a &#34;house in the sky,&#34; looking down at the woman shackled below, and finding strength and hope in the power of her own mind. Lindhout&#39;s decision, upon her release, to counter the violence she endured by founding an organization to help the Somali people rebuild their country through education is a wrenching testament to the capacity of the human spirit and an astonishing portrait of the power of compassion and forgiveness.",
    "id": "46kJAa2zkV6OTiB2zHzg6X",
    "images": [
      {
        "height": 640,
        "url": "https://i.scdn.co/image/ab676663000022a8071e33370b54de559d4b9f2f",
        "width": 640
      },
      {
        "height": 300,
        "url": "https://i.scdn.co/image/ab6766630000db5b071e33370b54de559d4b9f2f",
        "width": 300
      },
      {
        "height": 64,
        "url": "https://i.scdn.co/image/ab6766630000703b071e33370b54de559d4b9f2f",
        "width": 64
      }
    ],
    "is_externally_hosted": null,
    "languages": [
      "English"
    ],
    "media_type": "audio",
    "name": "A House in the Sky: A Memoir",
    "narrators": [
      {
        "name": "Amanda Lindhout"
      }
    ],
    "publisher": "Simon & Schuster",
    "total_chapters": 49,
    "type": "audiobook",
    "uri": "spotify:show:46kJAa2zkV6OTiB2zHzg6X"
  }
}