{
  "id": "2jMzcyQVheQvx9BwiY0wdz",
  "description": "",
  "chapter_number": 10,
  "duration_ms": 2361727,
  "explicit": false,
  "images": [
    {
      "height": 640,
      "url": "https://i.scdn.co/image/ab676663000022a8397ca44de3563bfccbbb4f08",
      "width": 640
    },
    {
      "height": 300,
      "url": "https://i.scdn.co/image/ab6766630000db5b397ca44de3563bfccbbb4f08",
      "width": 300
    },
    {
      "height": 64,
      "url": "https://i.scdn.co/image/ab6766630000703b397ca44de3563bfccbbb4f08",
      "width": 64
    }
  ],
  "languages": [
    ""
  ],
  "name": "Chapter 9",
  "audio_preview_url": null,
  "release_date": "0000",
  "release_date_precision": "year",
  "resume_point": {
    "fully_played": false,
    "resume_position_ms": 0
  },
  "html_description": "",
  "available_markets": [
    "CA",
    "US"
  ],
  "type": "chapter",
  "uri": "spotify:episode:2jMzcyQVheQvx9BwiY0wdz",
  "external_urls": {
    "spotify": "https://open.spotify.com/episode/2jMzcyQVheQvx9BwiY0wdz"
  },
  "href": "https://api.spotify.com/v1/chapters/2jMzcyQVheQvx9BwiY0wdz",
  "audiobook": {
    "authors": [
      {
        "name": "Jim Hutton"
      },
      {
        "name": "Tim Wapshott"
      }
    ],
    "available_markets": [
      "CA",
      "PR",
      "US"
    ],
    "copyrights": [],
    "description": "Author(s): Jim Hutton, Tim Wapshott\nNarrator(s): Patrick Moy\n\nThe relationship between Freddie Mercury and Jim Hutton evolved over several months in 1984 and 1985. Even when they first slept together, Hutton had no idea who Mercury was, and, when the star told him his name, it meant nothing to him. Hutton worked as a barber at the Savoy Hotel and retained his job and his lodgings in Sutton, Surrey, for two years after moving in with Mercury, and then worked as his gardener. He was never fully assimilated into Mercury's jet-setting lifestyle, nor did he want to be, but, from 1985 until Mercury's death in 1991, he was closer to him than anyone and knew all Mercury's closest friends: the other members of Queen, Elton John, David Bowie, and Phil Collins, to name a few. Ever present at the countless Sunday lunch gatherings and opulent parties, Hutton has a wealth of anecdotes as well as a deep understanding of Mercury's life. He also nursed Mercury through his terminal illness, often held him throughout the night in his final weeks, and was with him as he died. No one can tell the story of the last few years of Mercury's private life—the ecstasies and the agonies—more accurately or honestly than Jim Hutton.",
    "edition": "Unabridged",
    "explicit": false,
    "external_urls": {
      "spotify": "https://open.spotify.com/show/0RlthRtDSjPbUcKahSKJlh"
    },
    "href": "https://api.spotify.com/v1/audiobooks/0RlthRtDSjPbUcKahSKJlh",
    "html_description": "Author(s): Jim Hutton, Tim Wapshott<br/>Narrator(s): Patrick Moy<br/>The relationship between Freddie Mercury and Jim Hutton evolved over several months in 1984 and 1985. Even when they first slept together, Hutton had no idea who Mercury was, and, when the star told him his name, it meant nothing to him. Hutton worked as a barber at the Savoy Hotel and retained his job and his lodgings in Sutton, Surrey, for two years after moving in with Mercury, and then worked as his gardener. He was never fully assimilated into Mercury&#39;s jet-setting lifestyle, nor did he want to be, but, from 1985 until Mercury&#39;s death in 1991, he was closer to him than anyone and knew all Mercury&#39;s closest friends: the other members of Queen, Elton John, David Bowie, and Phil Collins, to name a few. Ever present at the countless Sunday lunch gatherings and opulent parties, Hutton has a wealth of anecdotes as well as a deep understanding of Mercury&#39;s life. He also nursed Mercury through his terminal illness, often held him throughout the night in his final weeks, and was with him as he died. No one can tell the story of the last few years of Mercury&#39;s private life—the ecstasies and the agonies—more accurately or honestly than Jim Hutton.",
    "id": "0RlthRtDSjPbUcKahSKJlh",
    "images": [
      {
        "height": 640,
        "url": "https://i.scdn.co/image/ab676663000022a8397ca44de3563bfccbbb4f08",
        "width": 640
      },
      {
        "height": 300,
        "url": "https://i.scdn.co/image/ab6766630000db5b397ca44de3563bfccbbb4f08",
        "width": 300
      },
      {
        "height": 64,
        "url": "https://i.scdn.co/image/ab6766630000703b397ca44de3563bfccbbb4f08",
        "width": 64
      }
    ],
    "is_externally_hosted": null,
    "languages": [
      "English"
    ],
    "media_type": "audio",
    "name": "Mercury and Me",
    "narrators": [
      {
        "name": "Patrick Moy"
      }
    ],
    "publisher": "Dreamscape Media",
    "total_chapters": 15,
    "type": "audiobook",
    "uri": "spotify:show:0RlthRtDSjPbUcKahSKJlh"
  }
}