{
  "id": "5a7mc7vHv7w8L6EVUAIBff",
  "description": "",
  "chapter_number": 9,
  "duration_ms": 1080291,
  "explicit": false,
  "images": [
    {
      "height": 640,
      "url": "https://i.scdn.co/image/ab676663000022a8baa056f5b191f9fdf8e414f7",
      "width": 640
    },
    {
      "height": 300,
      "url": "https://i.scdn.co/image/ab6766630000db5bbaa056f5b191f9fdf8e414f7",
      "width": 300
    },
    {
      "height": 64,
      "url": "https://i.scdn.co/image/ab6766630000703bbaa056f5b191f9fdf8e414f7",
      "width": 64
    }
  ],
  "languages": [
    ""
  ],
  "name": "Track 10",
  "audio_preview_url": null,
  "release_date": "0000",
  "release_date_precision": "year",
  "resume_point": {
    "fully_played": false,
    "resume_position_ms": 0
  },
  "html_description": "",
  "available_markets": [
    "AU",
    "CA",
    "GB",
    "IE",
    "NZ",
    "US"
  ],
  "type": "chapter",
  "uri": "spotify:episode:5a7mc7vHv7w8L6EVUAIBff",
  "external_urls": {
    "spotify": "https://open.spotify.com/episode/5a7mc7vHv7w8L6EVUAIBff"
  },
  "href": "https://api.spotify.com/v1/chapters/5a7mc7vHv7w8L6EVUAIBff",
  "audiobook": {
    "authors": [
      {
        "name": "Anastasia Ryan"
      }
    ],
    "available_markets": [
      "AU",
      "CA",
      "GB",
      "IE",
      "NZ",
      "PR",
      "US"
    ],
    "copyrights": [],
    "description": "Author(s): Anastasia Ryan\nNarrator(s): Jesse Vilinsky\n\nIt’s a man’s world, and Indiana Ana Aaron, a talented coder and IT specialist, doesn’t fit in. She says what she thinks, which frequently gets her in trouble and most recently has resulted in her transfer to a remote work team. She sees working from home as a chance at redemption (by keeping her head down and her camera off). But, almost immediately, her new boss makes a huge mistake in a report, and Ana feels compelled to point it out. She expects extreme repercussions, like before, but instead, the boss praises Mr. Aaron for his assertiveness and gives the team the afternoon off, to the delight of her fellow “bros.” It’s a simple error. Indiana is one of those names. But would it have gone that way if he had known what she looked like? She’s considering how to set everyone straight without making things worse when her work besties complicate things further. In a misguided attempt to “help” during a reference check, the legend of “Indiana” begins to take on a life of its own. Ana is suddenly in over her head. She doesn't know how to compete with her alter-ego “Indiana,” who is a former Navy SEAL, an emergency back-up goalie for the Colorado Avalanche, and an abstract artist. Fortunately, Ana is picking up more allies, including Shane, a handsome tech guy on her team who’s smart enough to put the puzzle together. But how can she be true to herself and follow her heart in the midst of this tangle?",
    "edition": "Unabridged",
    "explicit": false,
    "external_urls": {
      "spotify": "https://open.spotify.com/show/0IrBtdTOjpyupj8wVFhByG"
    },
    "href": "https://api.spotify.com/v1/audiobooks/0IrBtdTOjpyupj8wVFhByG",
    "html_description": "Author(s): Anastasia Ryan<br/>Narrator(s): Jesse Vilinsky<br/>It’s a man’s world, and Indiana Ana Aaron, a talented coder and IT specialist, doesn’t fit in. She says what she thinks, which frequently gets her in trouble and most recently has resulted in her transfer to a remote work team. She sees working from home as a chance at redemption (by keeping her head down and her camera off). But, almost immediately, her new boss makes a huge mistake in a report, and Ana feels compelled to point it out. She expects extreme repercussions, like before, but instead, the boss praises Mr. Aaron for his assertiveness and gives the team the afternoon off, to the delight of her fellow “bros.” It’s a simple error. Indiana is one of those names. But would it have gone that way if he had known what she looked like? She’s considering how to set everyone straight without making things worse when her work besties complicate things further. In a misguided attempt to “help” during a reference check, the legend of “Indiana” begins to take on a life of its own. Ana is suddenly in over her head. She doesn&#39;t know how to compete with her alter-ego “Indiana,” who is a former Navy SEAL, an emergency back-up goalie for the Colorado Avalanche, and an abstract artist. Fortunately, Ana is picking up more allies, including Shane, a handsome tech guy on her team who’s smart enough to put the puzzle together. But how can she be true to herself and follow her heart in the midst of this tangle?",
    "id": "0IrBtdTOjpyupj8wVFhByG",
    "images": [
      {
        "height": 640,
        "url": "https://i.scdn.co/image/ab676663000022a8baa056f5b191f9fdf8e414f7",
        "width": 640
      },
      {
        "height": 300,
        "url": "https://i.scdn.co/image/ab6766630000db5bbaa056f5b191f9fdf8e414f7",
        "width": 300
      },
      {
        "height": 64,
        "url": "https://i.scdn.co/image/ab6766630000703bbaa056f5b191f9fdf8e414f7",
        "width": 64
      }
    ],
    "is_externally_hosted": null,
    "languages": [
      "English"
    ],
    "media_type": "audio",
    "name": "Not Bad for a Girl",
    "narrators": [
      {
        "name": "Jesse Vilinsky"
      }
    ],
    "publisher": "Dreamscape Media",
    "total_chapters": 22,
    "type": "audiobook",
    "uri": "spotify:show:0IrBtdTOjpyupj8wVFhByG"
  }
}