{
  "id": "5cY7ajQciejdHMp14V0fM2",
  "description": "",
  "chapter_number": 23,
  "duration_ms": 1256337,
  "explicit": false,
  "images": [
    {
      "height": 640,
      "url": "https://i.scdn.co/image/ab676663000022a848dcc6482c01c27d6230a458",
      "width": 640
    },
    {
      "height": 300,
      "url": "https://i.scdn.co/image/ab6766630000db5b48dcc6482c01c27d6230a458",
      "width": 300
    },
    {
      "height": 64,
      "url": "https://i.scdn.co/image/ab6766630000703b48dcc6482c01c27d6230a458",
      "width": 64
    }
  ],
  "languages": [
    ""
  ],
  "name": "Chapter 23",
  "audio_preview_url": null,
  "release_date": "0000",
  "release_date_precision": "year",
  "resume_point": {
    "fully_played": false,
    "resume_position_ms": 0
  },
  "html_description": "",
  "available_markets": [
    "AU",
    "CA",
    "GB",
    "IE",
    "NZ",
    "US"
  ],
  "type": "chapter",
  "uri": "spotify:episode:5cY7ajQciejdHMp14V0fM2",
  "external_urls": {
    "spotify": "https://open.spotify.com/episode/5cY7ajQciejdHMp14V0fM2"
  },
  "href": "https://api.spotify.com/v1/chapters/5cY7ajQciejdHMp14V0fM2",
  "audiobook": {
    "authors": [
      {
        "name": "Kwame Mbalia"
      }
    ],
    "available_markets": [
      "AU",
      "CA",
      "GB",
      "IE",
      "NZ",
      "PR",
      "US"
    ],
    "copyrights": [],
    "description": "Author(s): Kwame Mbalia\nNarrator(s): Amir Abdullah\n\nBest-selling author Rick Riordan presents the finale of Kwame Mbalia's trilogy, in which Tristan Strong faces off with his archenemy, King Cotton, once and for all. \"Imagine if you combined Anansi the Spider, John Henry, and Marvel into, like, one book.\"-- New York Times best-selling author and Newbery Medalist Kwame Alexander After reuniting with Ayanna, who is now in his world, Tristan travels up the Mississippi in pursuit of his archenemy, King Cotton. Along the way they encounter new haints who are dead set on preventing their progress north to Tristan's hometown of Chicago. It's going to take many Alkean friends, including the gods themselves, the black flames of the afokena gloves, and all of Tristan's inner strength to deliver justice once and for all. Shocking twists, glorious triumphs, and a cast of unforgettable characters make this series conclusion as satisfying as it is entertaining. Complete your middle grade fantasy collection with these best-selling fan favorites: Rick Riordan Presents: Race to the Sun by Rebecca Roanhorse Rick Riordan Presents: City of the Plague God by Sarwat Chadda Rick Riordan Presents: Dragon Pearl by Yoon Ha Lee Rick Riordan Presents: Sal and Gabi Break the Universe by Carlos Hernandez The Percy Jackson and the Olympians series by Rick Riordan",
    "edition": "Unabridged",
    "explicit": false,
    "external_urls": {
      "spotify": "https://open.spotify.com/show/5sItdslhPf3XOy4790W9cc"
    },
    "href": "https://api.spotify.com/v1/audiobooks/5sItdslhPf3XOy4790W9cc",
    "html_description": "Author(s): Kwame Mbalia<br/>Narrator(s): Amir Abdullah<br/>Best-selling author Rick Riordan presents the finale of Kwame Mbalia&#39;s trilogy, in which Tristan Strong faces off with his archenemy, King Cotton, once and for all. &#34;Imagine if you combined Anansi the Spider, John Henry, and Marvel into, like, one book.&#34;-- New York Times best-selling author and Newbery Medalist Kwame Alexander After reuniting with Ayanna, who is now in his world, Tristan travels up the Mississippi in pursuit of his archenemy, King Cotton. Along the way they encounter new haints who are dead set on preventing their progress north to Tristan&#39;s hometown of Chicago. It&#39;s going to take many Alkean friends, including the gods themselves, the black flames of the afokena gloves, and all of Tristan&#39;s inner strength to deliver justice once and for all. Shocking twists, glorious triumphs, and a cast of unforgettable characters make this series conclusion as satisfying as it is entertaining. Complete your middle grade fantasy collection with these best-selling fan favorites: Rick Riordan Presents: Race to the Sun by Rebecca Roanhorse Rick Riordan Presents: City of the Plague God by Sarwat Chadda Rick Riordan Presents: Dragon Pearl by Yoon Ha Lee Rick Riordan Presents: Sal and Gabi Break the Universe by Carlos Hernandez The Percy Jackson and the Olympians series by Rick Riordan",
    "id": "5sItdslhPf3XOy4790W9cc",
    "images": [
      {
        "height": 640,
        "url": "https://i.scdn.co/image/ab676663000022a848dcc6482c01c27d6230a458",
        "width": 640
      },
      {
        "height": 300,
        "url": "https://i.scdn.co/image/ab6766630000db5b48dcc6482c01c27d6230a458",
        "width": 300
      },
      {
        "height": 64,
        "url": "https://i.scdn.co/image/ab6766630000703b48dcc6482c01c27d6230a458",
        "width": 64
      }
    ],
    "is_externally_hosted": null,
    "languages": [
      "English"
    ],
    "media_type": "audio",
    "name": "Tristan Strong Keeps Punching",
    "narrators": [
      {
        "name": "Amir Abdullah"
      }
    ],
    "publisher": "Disney Hyperion",
    "total_chapters": 37,
    "type": "audiobook",
    "uri": "spotify:show:5sItdslhPf3XOy4790W9cc"
  }
}