{
  "id": "6EdRKM8s65Hf91MmKwfKi3",
  "description": "",
  "chapter_number": 28,
  "duration_ms": 2995655,
  "explicit": false,
  "images": [
    {
      "height": 640,
      "url": "https://i.scdn.co/image/ab676663000022a8b334c50d4be341a965ec8ad4",
      "width": 640
    },
    {
      "height": 300,
      "url": "https://i.scdn.co/image/ab6766630000db5bb334c50d4be341a965ec8ad4",
      "width": 300
    },
    {
      "height": 64,
      "url": "https://i.scdn.co/image/ab6766630000703bb334c50d4be341a965ec8ad4",
      "width": 64
    }
  ],
  "languages": [
    ""
  ],
  "name": "Chapter 28",
  "audio_preview_url": null,
  "release_date": "0000",
  "release_date_precision": "year",
  "resume_point": {
    "fully_played": false,
    "resume_position_ms": 0
  },
  "html_description": "",
  "available_markets": [
    "CA"
  ],
  "type": "chapter",
  "uri": "spotify:episode:6EdRKM8s65Hf91MmKwfKi3",
  "external_urls": {
    "spotify": "https://open.spotify.com/episode/6EdRKM8s65Hf91MmKwfKi3"
  },
  "href": "https://api.spotify.com/v1/chapters/6EdRKM8s65Hf91MmKwfKi3",
  "audiobook": {
    "authors": [
      {
        "name": "Madeleine Thien"
      }
    ],
    "available_markets": [
      "CA"
    ],
    "copyrights": [],
    "description": "Author(s): Madeleine Thien\nNarrator(s): Angela Lin\n\nWinner of the Giller Prize and Longlisted for the Man Booker Prize. \"A vivid, magisterial novel that reaches back to China's civil war and up to the present day\" -The Guardian \"In a single year, my father left us twice. The first time, to end his marriage, and the second, when he took his own life. I was ten years old.\" Master storyteller Madeleine Thien takes us inside an extended family in China, showing us the lives of two successive generations-those who lived through Mao's Cultural Revolution and their children, who became the students protesting in Tiananmen Square. At the center of this epic story are two young women, Marie and Ai-Ming. Through their relationship Marie strives to piece together the tale of her fractured family in present-day Vancouver, seeking answers in the fragile layers of their collective story. Her quest will unveil how Kai, her enigmatic father, a talented pianist, and Ai-Ming's father, the shy and brilliant composer, Sparrow, along with the violin prodigy Zhuli were forced to reimagine their artistic and private selves during China's political campaigns and how their fates reverberate through the years with lasting consequences. With maturity and sophistication, humor and beauty, Thien has crafted a novel that is at once intimate and grandly political, rooted in the details of life inside China yet transcendent in its universality.",
    "edition": "Unabridged",
    "explicit": false,
    "external_urls": {
      "spotify": "https://open.spotify.com/show/5Uabz0KYVCsMdMl6ZuPzJM"
    },
    "href": "https://api.spotify.com/v1/audiobooks/5Uabz0KYVCsMdMl6ZuPzJM",
    "html_description": "Author(s): Madeleine Thien<br/>Narrator(s): Angela Lin<br/>Winner of the Giller Prize and Longlisted for the Man Booker Prize. &#34;A vivid, magisterial novel that reaches back to China&#39;s civil war and up to the present day&#34; -The Guardian &#34;In a single year, my father left us twice. The first time, to end his marriage, and the second, when he took his own life. I was ten years old.&#34; Master storyteller Madeleine Thien takes us inside an extended family in China, showing us the lives of two successive generations-those who lived through Mao&#39;s Cultural Revolution and their children, who became the students protesting in Tiananmen Square. At the center of this epic story are two young women, Marie and Ai-Ming. Through their relationship Marie strives to piece together the tale of her fractured family in present-day Vancouver, seeking answers in the fragile layers of their collective story. Her quest will unveil how Kai, her enigmatic father, a talented pianist, and Ai-Ming&#39;s father, the shy and brilliant composer, Sparrow, along with the violin prodigy Zhuli were forced to reimagine their artistic and private selves during China&#39;s political campaigns and how their fates reverberate through the years with lasting consequences. With maturity and sophistication, humor and beauty, Thien has crafted a novel that is at once intimate and grandly political, rooted in the details of life inside China yet transcendent in its universality.",
    "id": "5Uabz0KYVCsMdMl6ZuPzJM",
    "images": [
      {
        "height": 640,
        "url": "https://i.scdn.co/image/ab676663000022a8b334c50d4be341a965ec8ad4",
        "width": 640
      },
      {
        "height": 300,
        "url": "https://i.scdn.co/image/ab6766630000db5bb334c50d4be341a965ec8ad4",
        "width": 300
      },
      {
        "height": 64,
        "url": "https://i.scdn.co/image/ab6766630000703bb334c50d4be341a965ec8ad4",
        "width": 64
      }
    ],
    "is_externally_hosted": null,
    "languages": [
      "English"
    ],
    "media_type": "audio",
    "name": "Do Not Say We Have Nothing \"International Edition\"",
    "narrators": [
      {
        "name": "Angela Lin"
      }
    ],
    "publisher": "Recorded Books",
    "total_chapters": 32,
    "type": "audiobook",
    "uri": "spotify:show:5Uabz0KYVCsMdMl6ZuPzJM"
  }
}